---
kind: other
id: Methods.T:Autodesk.Revit.DB.EvaluatedParameter
source: html/748f5c4e-12e9-19a8-f0b6-29e99d4aa1ae.htm
---
# EvaluatedParameter Methods

Get the parameter value as a string with units.